# =====================================================================
#   2292번:    벌집
#   @date:   2026-01-30
#   @link:   https://www.acmicpc.net/problem/2292
#   @Motd:   폴더 내부에 있는 파일을 삭제하거나 변경하지 말아주세요.
#   @Test:   코드를 작성 후 "BOJ: 테스트"통해서 테스트를 해보세요.
# =====================================================================


"""

1 -> 2~7 6개
2 -> 8~19 12개
3 -> 20~37 18개
4 -> 38~61 24개

리스트 생성을 6개 12개 18개 .... 하면대나

실패
1
1 + 6
1 + 6 + 12
1 + 6 + 12 + 18


"""


import sys

input = sys.stdin.readline

N = int(input())

cnt = 1

end = 1
while N > end:
    end += cnt * 6
    cnt += 1
print(cnt)
