/*
두 직선이 평행한걸 알기위해
2선의 기울기를 비교하면된다.
*/

import java.util.*;

class Solution {
    public int solution(int[][] n) {
        int answer = 0;
        
        if((n[0][0] - n[1][0]) * (n[2][1] - n[3][1]) == 
           (n[2][0] - n[3][0]) * (n[0][1] - n[1][1])  
           ||
          (n[0][0] - n[2][0]) * (n[1][1] - n[3][1]) == 
           (n[1][0] - n[3][0]) * (n[0][1] - n[2][1])
           ||
           (n[0][0] - n[3][0]) * (n[1][1] - n[2][1]) == 
           (n[1][0] - n[2][0]) * (n[0][1] - n[3][1])) { answer = 1;}
        
        
        return answer;
    }
}